app/controllers/movies_controller.rb

  def index
    #sort_by = (params[:order] == 'starts_at' ? 'starts_at desc' : 'name')
   # sort_by = 'release_date desc'
   #@events = Event.find(:all, :order => sort_by)
   # respond_to do |format|
       # format.html # index.html.erb
       # format.xml { render :xml => @events }
    # end
   # @movies = Movie.all
  # @movies = Movie.find(:all, :order => sort_by)
  @all_ratings = Movie.get_ratings_list
    session[:params] = params
    sort_id = params[:sort_id]
    ratings = params[:ratings]

    if ratings == nil
      @movies = Movie.find(:all, :order => sort_id)
    else
      @movies = Movie.find(:all, :order => sort_id, :conditions => {:rating => ratings.keys})
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('PG', 'PG-13', 'R') ORDER BY release_date